FKDD_COPY_DIFF_3_2026-02-13/Documents/тт_РабочийЛистТрейдИн.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>тт_РабочийЛистТрейдИн</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Идентификатор юридического лица от которого выписан документ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Comment>Подразделение компании в котором был выписан документ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Comment>Автор документа - пользователь, породивший документ.</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Выполняемая документом операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Произвольный комментарий к документу</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автомобиль</Name>
					<Comment>Автомобиль</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Модель</Name>
					<Comment>Модель автомобиля</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Модели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Марка</Name>
					<Comment>Марка автомобиля</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.БТ_МаркиАвтомобилей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеПриема</Name>
					<Comment>Подразделение приема автомобиля</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеНахождения</Name>
					<Comment>Подразделение нахождения автомобиля</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.БТ_ТрейдИнСостояние</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.БТ_ТрейдИнСтатус</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комиссионер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоСобственников</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаГарантии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оценщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаПокупки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаПродажи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаПрайс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументПоступленияНаСклад</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеАвтомобилей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументПоступленияВТрейдИн</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеАвтомобилей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументПродажи</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияАвтомобилей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзмененияЦены</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоступленияНаСклад</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоступленияВТрейдИн</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПродажи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОтказа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БТ_ТрейдИН_ПричиныОтказа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГарМаржа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентНаценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МодельНовогоАвто</Name>
					<Comment>Модель автомобиля</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Модели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаличиеКолес</Name>
					<Type>
						<v8:Type>cfg:EnumRef.БТ_НаличиеКолесТрейдИн</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоКомплектовКолес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеКолес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МРЦКолес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТЧКолеса</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.БТ_ТипКолеса</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПрозводительШин</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ns_ПроизводителиШин</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МодельШины</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ns_TiresModels</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сезонность</Name>
							<Type>
								<v8:Type>cfg:EnumRef.БТ_Сезонность</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ширина</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БТ_ШиринаШины</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Высота</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БТ_ВысотаШины</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Диаметр</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БТ_ДиаметрШины</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПроизводства</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>7</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОстатокПротектора</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипДиска</Name>
							<Type>
								<v8:Type>cfg:EnumRef.БТ_ТипДиска</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/Documents/тт_РабочийЛистТрейдИн/Ext/ManagerModule.bsl
#Область ИнформацияОДокументе

//************************//
// ИНФОРМАЦИЯ О ДОКУМЕНТЕ //
//************************//


// Возвращает доступные варианты печати документа
// Параметры:
//	ДокументСсылка - Ссылка на документ печати
// Возвращаемое значение:
//	Структура, каждая строка которой соответствует одному из вариантов печати. Первый элемент структуры - форма по умолчанию
Функция ПолучитьСписокПечатныхФорм(ДокументСсылка) Экспорт
	
	СтруктураМакетов = Новый Структура();
	
	СтруктураМакетов.Вставить("Расчет"      , "Расчет");
	
	Возврат СтруктураМакетов;
	
КонецФункции // ПолучитьСписокПечатныхФорм()


#КонецОбласти  

Функция НайтиДанныеПоступления(Автомобиль,ТекДокумент) Экспорт 
	
	стр = Новый Структура;
	стр.Вставить("ЦенаПокупки",0);
	стр.Вставить("ДокументПоступленияНаСклад",Документы.ПоступлениеАвтомобилей.ПустаяСсылка());
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПоступлениеАвтомобилейАвтомобили.Ссылка КАК Ссылка,
		|	ПоступлениеАвтомобилейАвтомобили.Цена КАК Цена
		|ИЗ
		|	Документ.ПоступлениеАвтомобилей.Автомобили КАК ПоступлениеАвтомобилейАвтомобили
		|ГДЕ
		|	ПоступлениеАвтомобилейАвтомобили.Автомобиль = &Автомобиль
		|	И ПоступлениеАвтомобилейАвтомобили.Ссылка.Проведен
		|	И НЕ ПоступлениеАвтомобилейАвтомобили.Ссылка В
		|				(ВЫБРАТЬ
		|					тт_РабочийЛистТрейдИн.ДокументПоступленияНаСклад КАК ДокументПоступленияНаСклад
		|				ИЗ
		|					Документ.тт_РабочийЛистТрейдИн КАК тт_РабочийЛистТрейдИн
		|				ГДЕ
		|					тт_РабочийЛистТрейдИн.Ссылка <> &ТекДокумент
		|					И тт_РабочийЛистТрейдИн.Автомобиль = &Автомобиль
		|					И НЕ тт_РабочийЛистТрейдИн.Ссылка.ПометкаУдаления)";
	
	Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
	Запрос.УстановитьПараметр("ТекДокумент", ТекДокумент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		стр.ЦенаПокупки = ВыборкаДетальныеЗаписи.Цена;
		стр.ДокументПоступленияНаСклад = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат стр;

КонецФункции   

Функция НайтиДанныеРеализации(Автомобиль,ТекДокумент) Экспорт 
	
	стр = Новый Структура;
	стр.Вставить("ЦенаПродажи",0);
	стр.Вставить("ДокументПродажи",Документы.РеализацияАвтомобилей.ПустаяСсылка());
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеализацияАвтомобилейАвтомобили.Ссылка КАК Ссылка,
		|	РеализацияАвтомобилейАвтомобили.Цена КАК Цена
		|ИЗ
		|	Документ.РеализацияАвтомобилей.Автомобили КАК РеализацияАвтомобилейАвтомобили
		|ГДЕ
		|	РеализацияАвтомобилейАвтомобили.Автомобиль = &Автомобиль
		|	И РеализацияАвтомобилейАвтомобили.Ссылка.Проведен
		|	И НЕ РеализацияАвтомобилейАвтомобили.Ссылка В
		|				(ВЫБРАТЬ
		|					тт_РабочийЛистТрейдИн.ДокументПродажи КАК ДокументПродажи
		|				ИЗ
		|					Документ.тт_РабочийЛистТрейдИн КАК тт_РабочийЛистТрейдИн
		|				ГДЕ
		|					тт_РабочийЛистТрейдИн.Ссылка <> &ТекДокумент
		|					И тт_РабочийЛистТрейдИн.Автомобиль = &Автомобиль
		|					И НЕ тт_РабочийЛистТрейдИн.Ссылка.ПометкаУдаления)
		|	И РеализацияАвтомобилейАвтомобили.Ссылка.Дата >= &ДатаПокупки";
	
	Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
	Запрос.УстановитьПараметр("ТекДокумент", ТекДокумент);
	
	Если ЗначениеЗаполнено(ТекДокумент.ДокументПоступленияНаСклад) Тогда
		Запрос.УстановитьПараметр("ДатаПокупки", ТекДокумент.ДокументПоступленияНаСклад.Дата); 
	Иначе
		Запрос.УстановитьПараметр("ДатаПокупки", ТекДокумент.Дата); 
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		стр.ЦенаПродажи = ВыборкаДетальныеЗаписи.Цена;
		стр.ДокументПродажи = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат стр;

КонецФункции
